# ElementClassFilter Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementClassFilter Constructor
ElementClassFilter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementClassFilter(Type) | Constructs a new instance of a filter to match elements by class. |
| ElementClassFilter(Type, Boolean) | Constructs a new instance of a filter to match elements by class, with the option to match all elements which are not of the given class. |

# See Also
ElementClassFilter Class
ElementClassFilter Members
Autodesk.Revit.DB Namespace